import kyivImg from './assets/kyivska-rus-main1.png';
import halychImg from './assets/hal-kniaz-main2.png';
import kozDoba from './assets/koz-doba-main3.png'
import ww2 from './assets/ww2-main5.png'
import pysemn from './assets/pysemn-main4.png'
import nezal from './assets/nezal-main6.png'
export const quests = [
  {
    "title": "Київська Русь",
    "description": "Середньовічна держава зі столицею в Києві (IX–XIII ст.), що об’єднала східнослов’янські землі, розвинула торгівлю «шляхом із варяг у греки», прийняла християнство та заклала основи державності, права і культури України.",
    "imageUrl": kyivImg
  },
  {
    "title": "Галицько-Волинське князівство",
    "description": "Спадкоємець традицій Русі на заході (XIII–XIV ст.), що зберіг державність після занепаду Києва. За князювання Данила Романовича посилює дипломатію, містобудування та ремесла, інтегруючись у європейський політичний простір.",
    "imageUrl": halychImg
  },
  {
    "title": "Козацька доба",
    "description": "Час формування козацтва та Гетьманщини (XVI–XVIII ст.), визвольна війна під проводом Богдана Хмельницького, поява козацької демократії, полково-сотенного устрою, активний розвиток освіти, іконопису та барокової культури.",
    "imageUrl": kozDoba
  },
  {
    "title": "Розквіт писемництва XVIII ст.",
    "description": "Українське бароко в освіті й літературі: Києво-Могилянська академія, полемічна й мандрівна проза, козацькі літописи, розвиток драматургії та поезії. Поширюються рукописні та друковані тексти, формується інтелектуальний простір нового часу.",
    "imageUrl": pysemn
  },
  {
    "title": "Друга світова війна",
    "description": "1939–1945: Українські землі стають ареною запеклих боїв, окупаційних режимів і масових втрат. Попри трагедії Голокосту, депортацій і руйнувань, суспільство робить величезний внесок у перемогу над нацизмом і післявоєнну відбудову.",
    "imageUrl": ww2
  },
  {
    "title": "Незалежність України",
    "description": "Від 1991 року: розбудова суверенної держави, конституційного ладу, громадянського суспільства та євроінтеграційного курсу. Революції, спротив агресії РФ і модернізація країни зміцнюють національну ідентичність і прагнення свободи.",
    "imageUrl": nezal
  }
]
